In [2]:
import csv

header = ['Id','Species','Location']

rows = [
    [1,'Versicolor','India'],[2,'Versicolor','India'],[3,'Versicolor','India'],
    [4,'Versicolor','India'],[5,'Versicolor','India'],[6,'Versicolor','India']
]

with open('species.csv', mode='w', newline='') as file:
    writer = csv.writer(file)

    # Write the header
    writer.writerow(header)

    # Write the data rows
    writer.writerows(rows)

print("CSV file created successfully.")

CSV file created successfully.

In [6]:
import pandas as pd

df = pd.read_csv('species.csv')
df

   Id     Species Location
0   1  Versicolor    India
1   2  Versicolor    India
2   3  Versicolor    India
3   4  Versicolor    India
4   5  Versicolor    India
5   6  Versicolor    India

In [8]:
[ 
 {
    "id": 10,
    "specie": 'gentoo',
    "location": "New York"
  },
 {
    "id": 11,
    "specie": 'gentoo',
    "location": "London"
  },
 {
    "id": 12,
    "specie": 'king',
    "location": "New York"
  }, {
    "id": 13,
    "specie": 'gentoo',
    "location": "London"
  }, {
    "id": 14,
    "specie": 'king',
    "location": "New York"
  },    
]

[{'id': 10, 'specie': 'gentoo', 'location': 'New York'},
 {'id': 11, 'specie': 'gentoo', 'location': 'London'},
 {'id': 12, 'specie': 'king', 'location': 'New York'},
 {'id': 13, 'specie': 'gentoo', 'location': 'London'},
 {'id': 14, 'specie': 'king', 'location': 'New York'}]

In [10]:
import json

data = [ 
 {
    "id": 10,
    "specie": 'gentoo',
    "location": "New York"
  },
 {
    "id": 11,
    "specie": 'gentoo',
    "location": "London"
  },
 {
    "id": 12,
    "specie": 'king',
    "location": "New York"
  }, {
    "id": 13,
    "specie": 'gentoo',
    "location": "London"
  }, {
    "id": 14,
    "specie": 'king',
    "location": "New York"
  },    
]

with open('penguins.json', mode='w') as file:
    json.dump(data, file, indent=4)  # The indent parameter makes the JSON file readable

In [ ]:
tags

python, c, java script,

html -> webpages

SQL syntax -> querry data


</people>

database management XXXXX
basics that can help us manipulate data

SQL - syntax differs.... google 

concepts; SQL

databases -> db that have tables, 
school db

student table
teachers table

class table  -> id subject teachers students

(primary and foriegn keys)

In [16]:
import sqlite3 as sql

# Connect to a database (or create it if it doesn't exist)
connection = sql.connect('idrees.db')

# Create a cursor object using the connection. A cursor is a control structure that enables traversal over the records in a database.
cursor = connection.cursor()

In [18]:
# Create an sql table in python

cursor.execute('''
CREATE TABLE idrees_students(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    city TEXT
);
''')

In [20]:
# Commit the changes and close the connection
connection.commit()

In [28]:
# Insert data in sql table in python
cursor.execute("INSERT INTO idrees_students (id, name, city) VALUES (3, 'Sagar','Texas')")

# Commit the changes
connection.commit()

In [30]:
# Insert data in sql table in python
cursor.execute("INSERT INTO idrees_students (id, name, city) VALUES (4, 'Santosh','Austin')")

# Commit the changes
connection.commit()

In [36]:
# Query the data from sql table using python
cursor.execute("SELECT * FROM idrees_students")

# Fetch all results
res = cursor.fetchall()

In [40]:
res

[(1, 'Sagar', 'Texas'),
 (2, 'Ritika', 'Irving'),
 (3, 'Sagar', 'Texas'),
 (4, 'Santosh', 'Austin')]

In [42]:
import pandas as pd

x = pd.DataFrame(res)

In [44]:
x

   0        1       2
0  1    Sagar   Texas
1  2   Ritika  Irving
2  3    Sagar   Texas
3  4  Santosh  Austin

In [46]:
# Close the connection
connection.close()

In [48]:
# Query the data from sql table using python
cursor.execute("SELECT * FROM idrees_students")

# Fetch all results
res = cursor.fetchall()

ProgrammingError: Cannot operate on a closed database.

In [50]:
pip install sqlite3

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

In [52]:
import sqlite3 as sql

In [54]:
# import mysql dependency
import mysql.connector # cmd/terminal -> pip install 
import pandas as pd

In [56]:
# Connect to the MySQL database
connection = mysql.connector.connect(
    host='localhost',
    user='idrees',
    password='qwerty12345',
    database='idrees_db'
)

In [60]:
# Create a cursor object
cursor = connection.cursor()

In [62]:
# Query the data
cursor.execute("SELECT * FROM users")

# Fetch all results
results = cursor.fetchall()

In [64]:
results

[(1, 'Alice', 30), (2, 'Bob', 25)]

In [66]:
df = pd.DataFrame(results)
df

   0      1   2
0  1  Alice  30
1  2    Bob  25